= 英語を書くとか英訳するとか



日本語話者のエンジニアが英語を書くときにやりがちな失敗

== 例は「ex.」か

日本だと例示（Example）の略でex.って書く人が多いけど、exだと「前の彼女」を「ex-girlfriend」って言ったりするときの「前の」の意味なのでe.g. の方がよさそう。

== 英単語や数字の後ろに半角スペースは入れるべきか

== 機械翻訳があれば英語がまったく分からなくても訳せるか

機械翻訳もChatGPTも、しれっと真逆の意味に翻訳したり、間の文章を一文落としてきたり、逆に2回繰り返して訳してきたりする。

機械翻訳はあくまで電動自転車みたいなもので、自力で漕げないときには乗れない（＝乗ると事故るので乗ってはいけない）。

== 技術文書の翻訳に必須なのは「英語力」や「文章力」よりも「技術力」

ことITの分野においては、翻訳に必須な力は対象技術の知識、実際に触ったことがある深度の深い理解であって、日本語の文章力や、英語の文章力はその次。
どれかひとつしか手に入らないなら、絶対に技術力を優先して翻訳者を選ぶべき。

翻訳する人は「文脈が分かっている」と強い。
そもそも何の話か分かっているから、原文が多少説明不足でもピントの合った訳ができる。
技術ドキュメントを書くとき、あるいは翻訳するとき、「何を言っているのか」が分からないと、文法があっているだけで正しいことを何も伝えない、きれいで誤った文章になる。

== 翻訳は「もとの言いたいことに立ち返ってから」

伝えたいことと、実際に発露した文章の違い
発露した文章を元に翻訳しようとすると元のデータ量が減ってるので誤訳が生まれる

言いたいことがあって、そこから原文が生まれる、その時点で情報量は減っている。
JPEGみたいに、保存のたびに情報量が減衰していくので、元の「言いたいこと」に立ち返らずに翻訳をすると、原文から翻訳文になるときさらに情報量が減衰する。
文章としての体を為すため、その減衰を補おうとして、結果嘘が混ざる。
